In [1]:
# pip install pandas
# conda install pandas

# -->Analayze, clean and manipulate the data.
# 1. Data frame
# *two dimensional
# *size of the data frame is mutable
# *heterogenous tabular data(diff)
# *rows and colums

# 2. Series
# *one dimensional label array(it can hold any type inr,flt,stoat))
# *one dimension->Index

In [2]:
import pandas as pd

In [3]:
import numpy as np #it is used to create null value

In [4]:
s = pd.Series([1,2,3,4,5,6,np.nan,8,9,10]) #series

In [5]:
s

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [6]:
d = pd.date_range('20230102',periods=10) #creating a dataframe by passing an numpy array with 
# daytime index and label colums

In [7]:
d

DatetimeIndex(['2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05',
               '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09',
               '2023-01-10', '2023-01-11'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(10,4), index=d,columns=['A','B','C','D'])

In [9]:
df

                   A         B         C         D
2023-01-02  0.294449 -0.669557  1.082881 -0.608356
2023-01-03 -1.530602 -1.001636  0.277613  0.005745
2023-01-04  0.664070 -0.461478  0.100454  0.830750
2023-01-05 -0.905081 -0.608348  1.372222  0.803051
2023-01-06 -0.883053  1.687950 -0.446626 -0.771202
2023-01-07 -0.135570 -2.199801 -0.416947 -0.370005
2023-01-08 -0.076765 -0.554816  1.307539 -0.547091
2023-01-09 -1.130369  1.206264  0.602999 -1.033362
2023-01-10 -0.604860  0.351813  1.558359 -0.857725
2023-01-11 -0.248593  0.485526  1.171814 -1.763336

In [11]:
df1 = pd.DataFrame({'A':[1,2,3,4],
                   'B':pd.Timestamp('20230102'),
                   'C':pd.Series(1, index=list(range(0,4)),dtype='float32'),
                   'D':pd.array([5]*4, dtype='int32'),
                   'E':pd.Categorical(['True','False','True','False']),
                   'F':'Python'})#passing an dict

In [12]:
df1

   A          B    C  D      E       F
0  1 2023-01-02  1.0  5   True  Python
1  2 2023-01-02  1.0  5  False  Python
2  3 2023-01-02  1.0  5   True  Python
3  4 2023-01-02  1.0  5  False  Python

In [ ]:
df1.dtypes

In [ ]:
# HOW TO VIEW DATA?
df.dtypes

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.index

In [ ]:
df.columns

In [ ]:
df.describe()

In [13]:
df.sort_index(axis=1, ascending=True) #axis0(Y) axis1(X)

                   A         B         C         D
2023-01-02  0.294449 -0.669557  1.082881 -0.608356
2023-01-03 -1.530602 -1.001636  0.277613  0.005745
2023-01-04  0.664070 -0.461478  0.100454  0.830750
2023-01-05 -0.905081 -0.608348  1.372222  0.803051
2023-01-06 -0.883053  1.687950 -0.446626 -0.771202
2023-01-07 -0.135570 -2.199801 -0.416947 -0.370005
2023-01-08 -0.076765 -0.554816  1.307539 -0.547091
2023-01-09 -1.130369  1.206264  0.602999 -1.033362
2023-01-10 -0.604860  0.351813  1.558359 -0.857725
2023-01-11 -0.248593  0.485526  1.171814 -1.763336

In [14]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2023-01-11 -0.248593  0.485526  1.171814 -1.763336
2023-01-10 -0.604860  0.351813  1.558359 -0.857725
2023-01-09 -1.130369  1.206264  0.602999 -1.033362
2023-01-08 -0.076765 -0.554816  1.307539 -0.547091
2023-01-07 -0.135570 -2.199801 -0.416947 -0.370005
2023-01-06 -0.883053  1.687950 -0.446626 -0.771202
2023-01-05 -0.905081 -0.608348  1.372222  0.803051
2023-01-04  0.664070 -0.461478  0.100454  0.830750
2023-01-03 -1.530602 -1.001636  0.277613  0.005745
2023-01-02  0.294449 -0.669557  1.082881 -0.608356

In [15]:
df.sort_values(by='C')

                   A         B         C         D
2023-01-06 -0.883053  1.687950 -0.446626 -0.771202
2023-01-07 -0.135570 -2.199801 -0.416947 -0.370005
2023-01-04  0.664070 -0.461478  0.100454  0.830750
2023-01-03 -1.530602 -1.001636  0.277613  0.005745
2023-01-09 -1.130369  1.206264  0.602999 -1.033362
2023-01-02  0.294449 -0.669557  1.082881 -0.608356
2023-01-11 -0.248593  0.485526  1.171814 -1.763336
2023-01-08 -0.076765 -0.554816  1.307539 -0.547091
2023-01-05 -0.905081 -0.608348  1.372222  0.803051
2023-01-10 -0.604860  0.351813  1.558359 -0.857725

In [16]:
# HOW TO SELECT VALUES
df['C']

2023-01-02    1.082881
2023-01-03    0.277613
2023-01-04    0.100454
2023-01-05    1.372222
2023-01-06   -0.446626
2023-01-07   -0.416947
2023-01-08    1.307539
2023-01-09    0.602999
2023-01-10    1.558359
2023-01-11    1.171814
Freq: D, Name: C, dtype: float64

In [ ]:
df[0:3]

In [17]:
# HOW to select using labels
df.loc[d[0]]

A    0.294449
B   -0.669557
C    1.082881
D   -0.608356
Name: 2023-01-02 00:00:00, dtype: float64

In [ ]:
df.loc[:,['A','C']]

In [ ]:
df.loc['20230102':'20230105',['A','C']]

In [ ]:
df.loc['20230105',['A','C']]

In [ ]:
df.loc[d[0],['A','C']]

In [ ]:
df.at[d[0],'C']

In [ ]:
# using boolean
df[df['A']>0]

In [19]:
# HOW TO HANDLE MISSING DATA?
df2 =df.reindex(index=d[0:4], columns=list(df.columns) + ['E'])

In [20]:
df2

                   A         B         C         D   E
2023-01-02  0.294449 -0.669557  1.082881 -0.608356 NaN
2023-01-03 -1.530602 -1.001636  0.277613  0.005745 NaN
2023-01-04  0.664070 -0.461478  0.100454  0.830750 NaN
2023-01-05 -0.905081 -0.608348  1.372222  0.803051 NaN

In [21]:
df2.loc[d[0:2],'E']= 1

In [22]:
df2

                   A         B         C         D    E
2023-01-02  0.294449 -0.669557  1.082881 -0.608356  1.0
2023-01-03 -1.530602 -1.001636  0.277613  0.005745  1.0
2023-01-04  0.664070 -0.461478  0.100454  0.830750  NaN
2023-01-05 -0.905081 -0.608348  1.372222  0.803051  NaN

In [24]:
df2.isnull()

                A      B      C      D      E
2023-01-02  False  False  False  False  False
2023-01-03  False  False  False  False  False
2023-01-04  False  False  False  False   True
2023-01-05  False  False  False  False   True

In [25]:
df2.dropna()

                   A         B         C         D    E
2023-01-02  0.294449 -0.669557  1.082881 -0.608356  1.0
2023-01-03 -1.530602 -1.001636  0.277613  0.005745  1.0

In [ ]:
df2

In [ ]:
df2.fillna(value=2)

In [ ]:
# PANDAS OPERATIONS
# isnull(): The main task of isnull() is to return the true value if any row has null values.
# notnull(): It is opposite of isnull() function and it returns true values for not null value.
# dropna(): This method analyzes and drops the rows/columns of null values.
# fillna(): It allows the user to replace the NaN values with some other values.
# lower(): It converts any strings of the series or index into lowercase letters.
# upper(): It converts any string of the series or index into uppercase letters.
# and more

In [ ]:
df.mean()

In [26]:
s = pd.Series(('Python','is','a','programming','language',np.nan,'notes','jupyter'))

In [27]:
s.str.upper()

0         PYTHON
1             IS
2              A
3    PROGRAMMING
4       LANGUAGE
5            NaN
6          NOTES
7        JUPYTER
dtype: object

In [ ]:
s.str.lower()

In [ ]:
df = pd.DataFrame(np.random.randn(10,4))

In [ ]:
df

In [ ]:
df2 = [df[:3],df[3:7],df[7:]]

In [ ]:
df2

In [ ]:
pd.concat(df2)

In [30]:
# JOIN(LEFT&RIGHT)
left = pd.DataFrame({'A': [1,2], 'B': [3,4], 'C': [2,3]})

In [31]:
right = pd.DataFrame({'A': [3,2], 'D': [4,5], 'C':[2,4]})

In [32]:
left

   A  B  C
0  1  3  2
1  2  4  3

In [ ]:
right

In [33]:
pd.merge(left,right, on='C')

   A_x  B  C  A_y  D
0    1  3  2    3  4